package org.ar25.androidno.util

import org.junit.Assert
import org.junit.Test

class PostTokenTest{

    val text = """<p> Державний концерн «Укроборонпром» працює над створенням платформи UkrARPA, яка об’єднає розробників, стартапи, інвестиційні фонди та військових.&nbsp;Про таку ініціативу&nbsp;повідомили&nbsp;у прес-службі концерну.</p>
<p> «Укроборонпром» та керівництво Агенції передових оборонних дослідницьких проектів США (DARPA) напередодні&nbsp;провели зустріч, під час якої заступник директора DARPA Стівен Волкер запропонував концерну взяти участь в наукових дослідженнях, які проводить агентство.</p>
<p> Про створення платформи UkrARPA повідомив і Президент України Петро Порошенко на своїй сторінці у Facebook. За його словами, інноваційна платформа стане «аналогом американської Агенції передових оборонних дослідницьких проектів, у надрах якої був створений інтернет».</p>
<p> <img alt="" class="media-element file-wysiwyg" data-fid="91072" data-media-element="1" height="350" src="http://www.ar25.org/sites/default/files/16102104.jpg" width="525"></p>
<p> Нагадаємо, у липні цього року представники українських стартапів звернулися до Петра Порошенка з ініціативою створення спеціального державного інституту, який буде опікуватися питаннями інновацій. Тоді сторони домовились щодо фінансування з держбюджету напрямків, які на сьогоднішній день вирішують питання виживання держави. Зокрема, Міністерство оборони та «Укроборонпром»&nbsp;фінансуватимуть інноваційні розробки&nbsp;в галузі оборонної промисловості.</p>
<p> Довідка з ВІкіпедії:</p>
<p> <b>Аге́нтство передови́х оборо́нних дослідни́цьких прое́ктів</b>&nbsp;(<b>DARPA</b>) (англ.&nbsp;<i>Defense Advanced Research Projects Agency</i>) &nbsp;— агентство&nbsp;Міністерства оборони США, що відповідає за розробку нових технологій для використання в&nbsp;збройних силах США.</p>
"""


    @Test fun testParseHtmlTextToTokens(){
        val tokens = parseHtmlTextToTokens(text)

        Assert.assertEquals(tokens.size, 3)
        Assert.assertTrue(tokens[0] is PostToken.HtmlTextToken)
        Assert.assertTrue(tokens[1] is PostToken.ImageToken)
        Assert.assertTrue(tokens[2] is PostToken.HtmlTextToken)

        Assert.assertEquals((tokens[0] as PostToken.HtmlTextToken).text, "<p> Державний концерн «Укроборонпром» працює над створенням платформи UkrARPA, яка об’єднає розробників, стартапи, інвестиційні фонди та військових.&nbsp;Про таку ініціативу&nbsp;повідомили&nbsp;у прес-службі концерну.</p><p> «Укроборонпром» та керівництво Агенції передових оборонних дослідницьких проектів США (DARPA) напередодні&nbsp;провели зустріч, під час якої заступник директора DARPA Стівен Волкер запропонував концерну взяти участь в наукових дослідженнях, які проводить агентство.</p><p> Про створення платформи UkrARPA повідомив і Президент України Петро Порошенко на своїй сторінці у Facebook. За його словами, інноваційна платформа стане «аналогом американської Агенції передових оборонних дослідницьких проектів, у надрах якої був створений інтернет».</p>")
        Assert.assertEquals((tokens[1] as PostToken.ImageToken).imageUrl, "http://www.ar25.org/sites/default/files/16102104.jpg")
    }

}